---
kind: other
id: Properties.T:Autodesk.Revit.DB.WallFoundation
source: html/9c1b7e91-60a6-4920-a381-bcbb56c1c743.htm
---
# WallFoundation Properties

The id of the assembly instance to which the element belongs.